Revit 2027 API
BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecifiedError Property
 Major direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarSystemDirectionNotSpecifiedError { get; }
Public Shared ReadOnly Property RebarSystemDirectionNotSpecifiedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarSystemDirectionNotSpecifiedError {
	FailureDefinitionId^ get ();
}
static member RebarSystemDirectionNotSpecifiedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace